---
type: BoundaryValidation
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# BoundaryValidation

`Autodesk.Revit.DB.BoundaryValidation` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsValidBoundaryOnSketchPlane | 2023 | `public static bool IsValidBoundaryOnSketchPlane ( SketchPlane sketchPlane , IList < CurveLoop > curveLoops )` |
| Method | IsValidBoundaryOnView | 2023 | `public static bool IsValidBoundaryOnView ( Document document , ElementId viewId , IList < CurveLoop > curveLoops )` |
| Method | IsValidHorizontalBoundary | 2022 | `public static bool IsValidHorizontalBoundary ( IList < CurveLoop > curveLoops )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |